<!-- placeholder-1 -->
```fish
terraform plan -chdir=./terraform/aws/tf-ci
```
<!-- placeholder-2 -->

<details><summary>Diff of 2 changes.</summary>

```diff
+ module.s3-bucket.aws_s3_bucket.this[0] will be created
+ module.s3-bucket.aws_s3_bucket_public_access_block.this[0] will be created
```
</details>

<details><summary>✅ Validation Results: Success! The configuration is valid.</summary>

```hcl
Success! The configuration is valid.
```
</details>


<details><summary>🔒 Security Scan: Checkov: ⚠️ 1 failed, ✅ 2 passed, ⏭️ 0 skipped</summary>


```

       _               _
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V /
  \___|_| |_|\___|\___|_|\_\___/ \_/

By Prisma Cloud | version: 3.2.497 

terraform scan results:

Passed checks: 2, Failed checks: 1, Skipped checks: 0

Check: CKV_TF_2: "Ensure Terraform module sources use a tag with a version number"
	PASSED for resource: s3-bucket
	File: /main.tf:3-12
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/supply-chain-policies/terraform-policies/ensure-terraform-module-sources-use-tag
Check: CKV_AWS_41: "Ensure no hard coded AWS access key and secret key exists in provider"
	PASSED for resource: aws.default
	File: /terraform.tf:22-28
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/secrets-policies/bc-aws-secrets-5
Check: CKV_TF_1: "Ensure Terraform module sources use a commit hash"
	FAILED for resource: s3-bucket
	File: /main.tf:3-12
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/supply-chain-policies/terraform-policies/ensure-terraform-module-sources-use-git-url-with-commit-hash-revision

		3  | module "s3-bucket" {
		4  |   source  = "terraform-aws-modules/s3-bucket/aws"
		5  |   version = "5.10.0"
		6  | 
		7  |   bucket = "ex-${basename(path.cwd)}-tf-ci"
		8  | 
		9  |   tags = {
		10 |     ManagedBy = "terraform"
		11 |   }
		12 | }
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 2 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @KylerLoucks at 2026-01-13T02:20:44Z [(view log)](https://github.com/KylerLoucks/k8s-workshop-argo-platform/actions/runs/20942253675/job/60178118645#step:8:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3-bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ex-k8s-workshop-argo-platform-tf-ci"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "ManagedBy" = "terraform"
        }
      + tags_all                    = {
          + "ManagedBy" = "terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3-bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-1"
      + restrict_public_buckets = true
      + skip_destroy            = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-3-312186d19b3d72880ebb1f023de967f4.tfplan -->
<!-- placeholder-6 -->